Revit 2026 API

# MEPSectionGetCoefficient Method

---

Gets the loss coefficient for the specified element id in this section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetCoefficient(
	ElementId elemId
)
```
```vb
Public Function GetCoefficient (
	elemId As ElementId
) As Double
```
```cpp
public:
double GetCoefficient(
	ElementId^ elemId
)
```
```fsharp
member GetCoefficient :
        elemId : ElementId -> float
```

#### Parameters

elemId ElementId
     The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | The ElementId elemId does not correspond to a valid section member. |
| ArgumentNullException | A non-optional argument was null |

For Duct, it is loss coefficient. For Pipe, the loss coefficient is equivalent to the friction factor. Loss coefficient is a number. The unit type is UT_Number.

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace